app/controllers/plants_controller.rb

  def index
    response = HTTParty.get("https://trefle.io/api/v1/plants?token=tM_vyRwHmo__kNvStVE0N3950_E7eGC8nyoCqmZhEuA")
    # puts response.body
    result = JSON.parse(response.body)


    plant_data = result['data'].map do |element|
      data = {
        api_id: element['id'],
        common_name: element['common_name'],
        slug: element['slug'],
        scientific_name: element['scientific_name'],
        year: element['year'],
        rank: element['rank'],
        family_common_name: element['family_common_name'],
        image: element['image_url'],
        genus: element['genus'],
        family: element['family']
       }

    end



    @pagy, @plants = pagy(Plant.all, items: 10, size: [1,4,4,1])
---
SELECT "plants".* FROM "plants"
SELECT COUNT(*) FROM "plants"

  def create
    @plant = Plant.new(plant_params)

    if @plant.save
---
INSERT INTO "plants" ("api_id", "common_name", "slug", "scientific_name", "year", "rank", "family_common_name", "image", "genus", "family", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    if @plant.update(plant_params)
---
UPDATE "plants" SET "common_name" = $1, "updated_at" = $2 WHERE "plants"."id" = $3  [["common_name", "Stinging Spikey Jerk"], ["updated_at", "2020-12-19 00:10:52.675817"], ["id", 28]]

  def destroy
    @plant.destroy
---
DELETE FROM "plants" WHERE "plants"."id" = $1  [["id", 1]]